[
    {
        "id": "teachingassitant",
        "title": "Software Engineer Intern",
        "company": "Rose-Hulman Ventures",
        "location": "Terre Haute, IN",
        "startYearAndMonth": "2025-01",
        "endYearAndMonth": "2025-05",
        "shortDescription": "Developed and maintained web applications using React and Node.js. Created internal documentation and participated in code reviews.",
        "longDescription": "As a Software Engineer Intern at Rose-Hulman Ventures, I was responsible for developing and maintaining web applications using React and Node.js. My role involved creating internal documentation to facilitate knowledge sharing among team members and participating in code reviews to ensure code quality and adherence to best practices. I collaborated with cross-functional teams to deliver high-quality software solutions that met client requirements.",
        "skills": [
            "React",
            "Node.js",
            "TypeScript"
        ],
        "icon": "Laptop",
        "featured": true,
        "image": { "url": "/images/missing.jpg", "aspect": "aspect-[1]" }
    },
    {
        "id": "roseventures",
        "title": "Teaching Assistant",
        "company": "Rose-Hulman Institute of Technology",
        "location": "Terre Haute, IN",
        "startYearAndMonth": "2024-09",
        "shortDescription": "Assisted students in laboratory for introductory systems programming course. Provided support in understanding concepts and debugging code.",
        "longDescription": "In my role as a Teaching Assistant at Rose-Hulman Institute of Technology, I assisted students in the laboratory for an introductory systems programming course. My responsibilities included providing support to students in understanding complex programming concepts, debugging code, and guiding them through practical exercises.",
        "skills": [
            "C",
            "Linux",
            "Debugging"
        ],
        "icon": "BookOpen",
        "featured": true,
        "image": { "url": "/images/missing.jpg", "aspect": "aspect-[1]" }
    },
    {
        "id": "kidkare",
        "title": "Volunteer",
        "company": "Kid Kare Project, Inc.",
        "location":"Clinton, IN",
        "startYearAndMonth": "2021-09",
        "endYearAndMonth": "2023-05",
        "shortDescription": "Intalled and set-up workstation computers by intergrating them with existing network infrastructure. Assisted in website development and maintenance via Wix.",
        "longDescription": "As a Volunteer at Kid Kare Project, Inc., I was responsible for installing and setting up workstation computers, ensuring they were integrated with the existing network infrastructure. Additionally, I assisted in the development and maintenance of the organization's website using Wix, enhancing their online presence and functionality.",
        "skills": [
            "Wix",
            "Networking",
            "Computer Setup"
        ],
        "icon": "Heart",
        "featured": true,
        "image": { "url": "/images/missing.jpg", "aspect": "aspect-[1]" }
    }
]