[
    { "name": "React", "priority": 1, "description": "A JavaScript library for building web-application user interfaces, especially single-page applications. This website is built on it." },
    { "name": "Java", "priority": 2, "description": "A versatile, object-oriented programming language used for web, desktop, and mobile applications. See Game Sniper project entry for an example." },
    { "name": "C", "priority": 3, "description": "A foundational programming language used for system software, embedded systems, and performance-critical applications. See TA experience and thread project entry." },
    { "name": "HTML5", "priority": 4, "description": "The latest version of the standard markup language for creating web pages and web applications. See in Bulletin Board project entry." },
    { "name": "ARM Asm", "priority": 5, "description": "Assembly language for ARM processors, used in embedded systems and low-level programming. See TA experience entry." },
    { "name": "SQL", "priority": 6, "description": "A domain-specific language for managing and querying relational databases. See Game Sniper project entry." },
    { "name": "Python", "priority": 7, "description": "A high-level, interpreted programming language used for web development, automation, data analysis, and more. See Superhero Data Analysis project entry for an example." },
    { "name": "Lua", "priority": 8, "description": "A lightweight scripting language often used for embedded systems and game development. See Friend Purge project entry for an example." },
    { "name": "Verilog", "priority": 9, "description": "A hardware description language used to model electronic systems and design digital circuits. Used heavily in my Computer Architecture course." },
    { "name": ".NET Core", "priority": 10, "description": "A cross-platform, open-source framework for building modern web, desktop, and cloud applications. Researched this a lot in my internship at Rose-Hulman Ventures." },
    { "name": "Git", "priority": 11, "description": "A distributed version control system for tracking changes in source code during software development. See my Github for examples." },
    { "name": "Leadership", "priority": 12, "description": "The ability to guide teams, manage projects, and drive successful outcomes in collaborative environments. I was the coordinator for many of my group projects including xv6 threads and Game Sniper." }
]
